jeffersonjhunt/pinled/sdkconfig.defaults
# pinled v2 build defaults (ESP-IDF 5.5.x, target esp32s3)
#
# Board: Adafruit QT Py ESP32-S3. Two variants ship under the same silkscreen
# and the same USB VID/PID (239a:8143) — tell them apart by the chip marking or
# the USB descriptor string:
#
#   FN8C0 -> 8 MB flash, no PSRAM     <- the bench board from 2026-08-15
#   FH4R2 -> 4 MB flash, 2 MB PSRAM   <- the 2026-08-07 bench board, retired
#
# 8 MB, and it is no longer a free choice: partitions.csv now carries two 3 MB
# OTA slots and runs to 0x800000 exactly, so this build DOES NOT FIT an FH4R2
# and must not be flashed to one. Declaring 8 MB on a 4 MB part makes the
# bootloader configure flash that is not there, and the failure is not
# graceful.
#
# The two variants share a silkscreen and a USB VID/PID (239a:8143) — tell them
# apart by the chip marking or the USB descriptor string before flashing. If the
# 4 MB board is ever wanted again it needs its own table, not a smaller value
# here.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# PSRAM stays disabled. The FH4R2's 2 MB is quad-SPI and nothing in the firmware
# needs it — the scan/level buffers are a few hundred bytes. Enabling it only
# costs boot time and pins.

# The QT Py ESP32-S3 has no USB-UART bridge — USB-C goes straight to the S3's
# native USB. Without this the console is on UART0 and `idf.py monitor` shows
# nothing.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Custom partition table with an NVS partition for machine profiles
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# A little more main-task stack for init
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# FreeRTOS tick at 1 kHz eases sub-ms task timing during bring-up
CONFIG_FREERTOS_HZ=1000

# Compiler
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# TIMING.md section 2 derives every scan-budget number from a 240 MHz LX7.
# The esp32s3 default is 160 MHz, which inflates the frame budget by 1.5x.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# The live monitor is a WebSocket (FR-UI-5). Off by default in IDF, and its
# absence also changes the shape of httpd_uri_t, which is why api.cpp assigns
# that struct field by field rather than brace-initialising it.
CONFIG_HTTPD_WS_SUPPORT=y
